# Pandas library

- Pandas is one of the python library which deals with data manipulation ,cleaning ,preprocessing ,etc....
- Pandas is applied for different formats like Excel,CSV,json etc....

In [2]:
import pandas as pd

# different ways to create series

In [4]:
#create series using list
s1=pd.Series([10,20,30]) 
s1

0    10
1    20
2    30
dtype: int64

In [7]:
#crete series using set
s2=pd.Series((10,20,10))
s2

0    10
1    20
2    10
dtype: int64

In [8]:
# create a series using dictionary
dict3 = {'a':11,'b':'ab','c':12}
s3=pd.Series(dict3)
s3

a    11
b    ab
c    12
dtype: object

In [11]:
#create a series using numpy array
s4=pd.Series(pd.array([1,2,3,4,5]))
s4

0    1
1    2
2    3
3    4
4    5
dtype: Int64

In [12]:
s5=pd.Series([122,1234,899])

In [13]:
s6=pd.Series([234,500,768])

In [14]:
print(s5+s6)

0     356
1    1734
2    1667
dtype: int64

In [15]:
print(s5-s6)

0   -112
1    734
2    131
dtype: int64

In [16]:
print(s5*s6)

0     28548
1    617000
2    690432
dtype: int64

# Create Dataframe

In [17]:
dict1={'Trainers':['Mounika','siva','Mahadevi'],'Subjects':['Python','Da','ML'],'id':[123,342,234]}
df1=pd.DataFrame(dict1)
df1

   Trainers Subjects   id
0   Mounika   Python  123
1      siva       Da  342
2  Mahadevi       ML  234

In [19]:
df1.loc['0':'1',['Trainers','Subjects']]

  Trainers Subjects
0  Mounika   Python
1     siva       Da

# create 2 data frames

In [21]:
dict1={'Sports':['Cricket','hockey','CoCo'],'Score':[9,7,8.6],'Team':['CS_team','EC_team','it_team']} 
df1=pd.DataFrame(dict1,index=['A','B','C'])

In [22]:
dict2={'Sports':['TempleRun','PubG','Ludo'],'Score':[5,6,7],
      'Team':['Mech_tm','Civil_tm','EEE_tm']}
df2 = pd.DataFrame(dict2,index=['A','B','C'])

# combine df1 and df2

In [23]:
pd.concat([df1,df2])

      Sports  Score      Team
A    Cricket    9.0   CS_team
B     hockey    7.0   EC_team
C       CoCo    8.6   it_team
A  TempleRun    5.0   Mech_tm
B       PubG    6.0  Civil_tm
C       Ludo    7.0    EEE_tm

In [24]:
pd.concat([df1,df2],axis=1)

    Sports  Score     Team     Sports  Score      Team
A  Cricket    9.0  CS_team  TempleRun      5   Mech_tm
B   hockey    7.0  EC_team       PubG      6  Civil_tm
C     CoCo    8.6  it_team       Ludo      7    EEE_tm

# Adding a row and column

In [25]:
df1

    Sports  Score     Team
A  Cricket    9.0  CS_team
B   hockey    7.0  EC_team
C     CoCo    8.6  it_team

In [27]:
df1.append({'Score':10,'Sports':'Basketball','Team':'Agri_team'},ignore_index=True)

       Sports  Score       Team
0     Cricket    9.0    CS_team
1      hockey    7.0    EC_team
2        CoCo    8.6    it_team
3  Basketball   10.0  Agri_team

In [ ]:
df1['win/lose'] = ['Win','Lost','Win']